In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.read_csv("dataset_group.csv")

In [4]:
df

             Date  Order_id            Product
0      01-01-2018         1             yogurt
1      01-01-2018         1               pork
2      01-01-2018         1      sandwich bags
3      01-01-2018         1         lunch meat
4      01-01-2018         1       all- purpose
...           ...       ...                ...
20636  25-02-2020      1138               soda
20637  25-02-2020      1138       paper towels
20638  26-02-2020      1139               soda
20639  26-02-2020      1139  laundry detergent
20640  26-02-2020      1139            shampoo

[20641 rows x 3 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [6]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Date,20641,603,08-02-2019,183,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Order_id,20641.0,NaN,NaN,NaN,575.986289,328.557078,1.0,292.0,581.0,862.0,1139.0
Product,20641,37,poultry,640,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.isna().sum() # 0 missing values

Date        0
Order_id    0
Product     0
dtype: int64

In [8]:
df.duplicated().sum() 
# There can be multiple transactions on a single day under same order id 
# count of duplicates can hence be miss leading

4730

In [9]:
df[df.duplicated()==True]

             Date  Order_id        Product
10     01-01-2018         1   all- purpose
13     01-01-2018         1   all- purpose
18     01-01-2018         1   dinner rolls
29     01-01-2018         2        waffles
31     01-01-2018         2      hand soap
...           ...       ...            ...
20616  24-02-2020      1137   paper towels
20632  25-02-2020      1138  sandwich bags
20633  25-02-2020      1138   toilet paper
20635  25-02-2020      1138           soda
20636  25-02-2020      1138           soda

[4730 rows x 3 columns]

In [10]:
df.Product.value_counts()

poultry                         640
soda                            597
cereals                         591
ice cream                       579
cheeses                         578
waffles                         575
soap                            574
bagels                          573
lunch meat                      573
juice                           570
eggs                            570
toilet paper                    569
dinner rolls                    567
aluminum foil                   566
coffee/tea                      565
shampoo                         562
beef                            561
paper towels                    556
flour                           555
butter                          555
milk                            555
mixes                           554
dishwashing liquid/detergent    551
all- purpose                    551
ketchup                         548
yogurt                          545
individual meals                544
tortillas                       543
pasta                           542
laundry detergent               542
spaghetti sauce                 536
sandwich bags                   536
sugar                           533
pork                            531
fruits                          529
sandwich loaves                 523
hand soap                       502
Name: Product, dtype: int64